#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113402076881]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_control_plane_1_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_control_plane_2_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_control_plane_3_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_lb_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_lb_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_lb_1_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_lb_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_lb_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_lb_2_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s_rook_1_dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s_rook_2_dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s_rook_3_dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_router_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_router_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_router_1_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_worker_node_1_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_worker_node_2_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s_worker_node_3_dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_internet.k8s_external_switch will be created
  + resource "sakuracloud_internet" "k8s_external_switch" {
      + band_width           = 100
      + gateway              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = "k8s_external_switch"
      + netmask              = 28
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_control_plane_1_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_control_plane_1_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.10"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_control_plane_2_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_control_plane_2_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.11"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_control_plane_3_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_control_plane_3_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.12"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_lb[0] will be created
  + resource "sakuracloud_server" "k8s_lb" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s_lb_1_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_lb_1_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.30"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_lb[1] will be created
  + resource "sakuracloud_server" "k8s_lb" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s_lb_2_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_lb_2_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.31"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_router[0] will be created
  + resource "sakuracloud_server" "k8s_router" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s_router_1_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_router_1_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_worker_node_1_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_worker_node_1_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_worker_node_2_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_worker_node_2_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s_worker_node_3_dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s_worker_node_3_dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.22"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_ssh_key_gen.gen_key will be created
  + resource "sakuracloud_ssh_key_gen" "gen_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "k8s_pub_key"
      + private_key = (known after apply)
      + public_key  = (known after apply)
    }

  # sakuracloud_subnet.bgp_subnet will be created
  + resource "sakuracloud_subnet" "bgp_subnet" {
      + id              = (known after apply)
      + internet_id     = (known after apply)
      + ip_addresses    = (known after apply)
      + max_ip_address  = (known after apply)
      + min_ip_address  = (known after apply)
      + netmask         = 28
      + network_address = (known after apply)
      + next_hop        = (known after apply)
      + switch_id       = (known after apply)
      + zone            = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_switch.k8s_internal_switch will be created
  + resource "sakuracloud_switch" "k8s_internal_switch" {
      + id         = (known after apply)
      + name       = "k8s_internal_switch"
      + server_ids = (known after apply)
      + zone       = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_address_range       = (known after apply)
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_lb_ip_address            = [
      + (known after apply),
      + (known after apply),
    ]
  + k8s_router_ip_address        = [
      + (known after apply),
    ]
  + k8s_worker_node_ip_address   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vip_address                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>